import { FAQ } from '../components/Homepage/FAQArea';
const FAQList: FAQ[] = [
  {
    no: 1,
    title: '자신에 대해 자유롭게 표현해주세요.',
    description:
      '저는 긍정적이고 밝은 성격을 가졌으며, 새로운 사람과 친해지기 좋아하는 신입 개발자 최하영입니다. 모르는것을 그냥 지나치지 않고 알고 넘어가려 하며 아는 것을 나누기 좋아합니다.',
  },
  {
    no: 2,
    title: '전기 전공에서 개발자로 전향한 사유가 무엇인가요?',
    description:
      '눈에 보이지 않는 막연한 이론 위주의 전기와 다르게 프론트엔드 개발은 결과물을 눈으로 확인하고 수정하고 고민하며 만들어가는 과정이 너무 재미있었습니다.',
  },
  {
    no: 3,
    title: '프로그래밍을 생업으로 삼기로 결정한 이유가 있나요?',
    description:
      '많은 사람들이 끊임없이 고민하고 공부해야 한다는걸 단점으로 말할 때 나는 그 과정을 기대하며 즐기고 있다는걸 알았을 때 마음을 먹었습니다.',
  },
  {
    no: 4,
    title: '본인의 개발 학습 방법을 구체적으로 설명해주세요.',
    description:
      '강의를 듣고 들은 내용을 토대로 예시 코드를 짜보며 궁금했던 부분과 배운 내용을 이해하는 시간을 가집니다.',
  },
  {
    no: 5,
    title: '개발하다 어려운 부분을 만났을 때 어떻게 대처하나요?',
    description:
      '혼자 고민하고 검색을 하는 시간을 가집니다. 그 후에도 해결이 되지 않는 문제들은 조언을 구하기 위해 질문을 합니다.',
  },
  {
    no: 6,
    title: '협업을 하면서 기억에 남는 점이 있다면 이야기 해주세요.',
    description:
      '협업을 하며 나의 코드를 공유하고 남의 코드를 읽고 이해하려 하며 어려움이 많았습니다. 그로 인해 가독성이 좋고 일관된 코드 스타일을 유지하는 것이 매우 중요하다는 점이 기억에 남았습니다.',
  },
];
export default FAQList;
