import { FAQ } from '../components/FAQArea';
const FAQList: FAQ[] = [
  {
    no: 1,
    title: '제목1',
    description:
      '내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1내용1',
  },
  {
    no: 2,
    title: '제목2',
    description:
      '내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2내용2',
  },
  {
    no: 3,
    title: '제목3',
    description: '내용3',
  },
  {
    no: 4,
    title: '제목4',
    description: '내용4',
  },
  {
    no: 5,
    title: '제목5',
    description: '내용5',
  },
  {
    no: 6,
    title: '제목6',
    description: '내용6',
  },
];
export default FAQList;
