import { FAQ } from '../components/Homepage/FAQArea';
const FAQList: FAQ[] = [
  {
    no: 1,
    title: '자신에 대해 자유롭게 표현해주세요.',
    description:
      '저는 긍정적이고 밝은 성격을 가졌으며, 새로운 사람과 친해지기 좋아하는 신입 개발자 최하영입니다. 모르는것을 그냥 지나가지 않고 알고 넘어가려 하며 배우고 알려주는 것을 좋아합니다.',
  },
  {
    no: 2,
    title: '전기 전공에서 개발자로 전향한 사유가 무엇인가요?',
    description:
      '눈에 보이지 않는 막연한 이론 위주의 전기공학과 다르게 프론트엔드 개발은 결과물을 눈으로 확인하며, 문제들이 발생 했을 때 고민하고 해결하는 과정에서 흥미를 느껴 전문적인 공부를 시작하게 되었습니다.',
  },
  {
    no: 3,
    title: '프로그래밍을 생업으로 삼기로 결정한 이유가 있나요?',
    description:
      '대학시절부터 하고싶은 일을 하며 돈을 벌고 싶다는 생각을 했고, 개발에서 흥미를 느꼈을 때 개발자에 대해 고민을 시작했습니다. 공부를 하다보니 많은 사람들이 항상 고민하고 공부해야 한다는걸 단점으로 말했습니다. 하지만 저는 그 과정을 기대하며 즐기고 있다는걸 알았을 때 개발자가 되겠다는 결정을 내렸습니다.',
  },
  {
    no: 4,
    title: '본인의 개발 학습 방법을 구체적으로 설명해주세요.',
    description:
      '강의를 듣고 들은 내용을 토대로 예시 코드를 짜보며 궁금했던 부분과 배운 내용을 이해하는 시간을 가집니다. 그러다보면 모르는 용어들과 코드들이 나오고 찾아보고 공부하며 학습합니다.',
  },
  {
    no: 5,
    title: '개발하다 어려운 부분을 만났을 때 어떻게 대처하나요?',
    description:
      '혼자 고민하고 검색을 하는 시간을 가집니다. 그 후에도 해결이 되지 않는 문제들은 조언을 구하기 위해 질문을 합니다. 이렇게 남의 조언을 듣고 해결한 문제들은 해결에 그치지 않고 비슷한 코드로 다시 구현을 해보거나 혼자서 코드를 리뷰하는 시간을 가집니다.',
  },
  {
    no: 6,
    title: '협업을 하면서 기억에 남는 점이 있다면 이야기 해주세요.',
    description:
      '협업을 하며 나의 코드를 공유하고 남의 코드를 읽고 이해하려 하며 어려움이 많았습니다. 그로 인해 가독성이 좋고 일관된 코드 스타일을 유지하는 것이 매우 중요하다는 점이 기억에 남았습니다. 예를 들면 변수명을 정하거나 코드들을 분류하는 기준 등을 명확히 해야 한다는 점입니다.',
  },
];
export default FAQList;
