import { FAQ } from '../components/FAQArea';
const FAQList: FAQ[] = [
  {
    no: 1,
    title: '자신에 대해 자유롭게 표현해주세요.',
    description:
      '저는 긍정적이고 밝은 성격을 가졌으며, 새로운 사람과 친해지기 좋아하는 신입 개발자 최하영입니다. 모르는것을 그냥 지나치지 않고 알고 넘어가려 하며 아는 것을 나누기 좋아합니다.',
  },
  {
    no: 2,
    title: '전기 전공에서 개발자로 전향한 사유가 무엇인가요?',
    description:
      '눈에 보이지 않는 막연한 이론 위주의 전기와 다르게 프론트엔드 개발은 결과물을 눈으로 확인하고 수정하고 고민하며 만들어가는 과정이 너무 재미있었다.',
  },
  {
    no: 3,
    title: '프로그래밍을 생업으로 삼기로 결정한 이유가 있나요?',
    description:
      '많은 사람들이 끊임없이 고민하고 공부해야 한다는걸 단점으로 말할 때 나는 그 과정을 기대하며 즐기고 있다는걸 알았을 때 마음을 먹었습니다.',
  },
  {
    no: 4,
    title: '본인의 개발 학습 방법을 구체적으로 설명해주세요',
    description:
      '강의를 듣고 들은 내용을 토대로 예시 코드를 짜보며 궁금했던 부분과 배운 내용을 이해하는 시간을 가진다.',
  },
  {
    no: 5,
    title: '제목5',
    description: '내용5',
  },
  {
    no: 6,
    title: '제목6',
    description: '내용6',
  },
];
export default FAQList;
